# -*- coding: utf-8 -*-

from __future__ import unicode_literals

from expand_cu import multi_replace

# This table comes from a script from the Ponomar Project (http://www.ponomar.net/cu_support.html),
# lincensed under the GNU General Public License.
# Source: http://www.ponomar.net/cgi-bin/fetch_script.cgi?target=hip
PAIRS = [
    ("<i>",        '\u0456'),
    ("_i",         '\uF8FF'),        # numeric i is taken to private use and replaced below
    ("i",          '\u0456'),
    ("<i_>",       '\uA647'),
    ("<е>",        '\u0454'),
    ("_е",         '\u0454'),
    ("_Е",         '\u0404'),
    ("<Е>",        '\u0404'),
    ("_кс",        '\u046F'),
    ("_КС",        '\u046E'),
    ("_Кс",        '\u046E'),
    ("<кс>",       '\u046F'),
    ("<КС>",       '\u046E'),
    ("<Кс>",       '\u046E'),
    ("<о>",        '\u047B'),
    ("<О>",        '\u047A'),
    ("_о",         '\u047B'),
    ("_О",         '\u047A'),
    ("w\\т",       '\u047F'),
    ("W\\т",       '\u047E'),
    ("W\\Т",       '\u047E'),
    ("<w>",        '\u047D'),
    ("<W>",        '\u047C'),
    ("_w",         '\u047D'),
    ("_W",         '\u047C'),
    ("w",          '\u0461'),
    ("W",          '\u0460'),
    ("<пс>",       '\u0471'),
    ("<ПС>",       '\u0470'),
    ("<Пс>",       '\u0470'),
    ("_пс",        '\u0471'),
    ("_ПС",        '\u0470'),
    ("_Пс",        '\u0470'),
    ("<у>",        '\u0443'),
    ("_у",         '\u0443'),
    ("о<у>",       '\u043E\u0443'),
    ("о_у",        '\u043E\u0443'),
    ("О<у>",       '\u041E\u0443'),
    ("О_у",        '\u041E\u0443'),
    ("у",          '\uA64B'),
    ("У",          '\uA64A'),
    ("jа",         '\uA657'),
    ("JА",         '\uA656'),
    ("Jа",         '\uA656'),
    ("я",          '\u0467'),
    ("Я",          '\u0466'),
    ("<а>",        "⍰"),             # sending az variant to alpha ?
    ("<г>",        '\u0491'),
    ("<Г>",        '\u0490'),
    ("<д>",        '\u0434\uFE00'),
    ("<дг>",       '\uA663'),
    ("<ДГ>",       '\uA662'),
    ("<дж>",       '\u045F'),
    ("<ДЖ>",       '\u040F'),
    ("jе",         '\u0465'),
    ("JЕ",         '\u0464'),
    ("Jе",         '\u0464'),
    ("jjь",        '\uA653'),
    ("JJЬ",        '\uA652'),
    ("<jь>",       '\u0463\uFE00'),
    ("</jь>",      '\u0463'),        # we do not know what the Yat' with a slash is
    ("<sг>",       '\uA643'),
    ("<s->",       '\uA643'),        # undocumented
    ("<s>",        '\uA645'),
    ("<з>",        '\uA641'),
    ("g",          '\uA649'),
    ("<лг>",       '\uA665'),
    ("<нг>",       '\u04A5'),
    ("<оо>",       '\uA699'),
    ("<о+>",       '\uA69B'),
    ("<о.о.>",     '\uA66D'),
    ("<о.>",       '\uA669'),
    ("<о:>",       '\uA66B'),
    ("<о_>",       '\u043E\uFE00'),
    ("<_w>",       '\uA64D'),
    ("<с>",        '\u0441\uFE00'),  # СЛОВО (крупное начертание, вылезающее под строку)
    ("<т>",        '\u0442\uFE00'),  # ТВЕРДО (высокое начертание)
    ("<|т|>",      '\u0442\uFE01'),  # ТВЕРДО (трехмачтовое начертание)
    ("<оv>",       '\uA64B\uFE00'),
    ("<ч>",        '\u0447'),        # ЧЕРВЬ (чашеобразное начертание)
    ("q",          '\u0481'),
    ("<ъ>",        '\u044A\uFE00'),
    ("<ы>",        '\uA651'),        # ЕРЫ (в виде ЪI)
    ("<ьi_>",      '\u044C\uA647'),  # ЕРЫ (в виде ЬL)
    ("<ъi_>",      '\u044A\uA647'),  # ЕРЫ (в виде ЪL)
    ("<ьи>",       '\u044C\u0438'),  # ЕРЫ (в виде ЬИ)
    ("<ъи>",       '\u044A\u0438'),  # ЕРЫ (в виде ЪИ)
    ("<ь-i>",      "⍰"),             # ЕРЫ (в виде ЬI с соединительной черточкой)
    ("<ъ-i>",      "⍰"),             # ЕРЫ (в виде ЪI с соединительной черточкой)
    ("<ь-i_>",     "⍰"),             # ЕРЫ (в виде ЬL с соединительной черточкой)
    ("<ъ-i_>",     "⍰"),             # ЕРЫ (в виде ЪL с соединительной черточкой)
    ("<ь-и>",      "⍰"),             # ЕРЫ (в виде ЬИ с соединительной черточкой)
    ("<ъ-и>",      "⍰"),             # ЕРЫ (в виде ЪИ с соединительной черточкой)
    ("э",          '\u044D'),
    ("Э",          '\u042D'),
    ("<ю>",        '\uA655'),        # Ю (зеркальное начертание)
    ("ю\\@",       '\u044E\u0306'),  # Ю КРАТКОЕ старой молдавской (румынской) печати
    ("I",          '\u0406'),
    ("<jа>",       '\uA657'),        # Я (в виде "лигатуры" IА с соединением посредине)
    ("jя",         '\u0469'),        # ЙОТИРОВАННЫЙ ЮС МАЛЫЙ
    ("<яu>",       '\uA65B'),        # ТРЕТИЙ ЮС (ЮС БОЛЬШОЙ, низ которого нарисован как ЮС МАЛЫЙ)
    ("<я.>",       "⍰"),             # ЮС МАЛЫЙ (в виде A с "прогнутой вниз" гориз. линией)
    ("<я>",        '\uA659'),        # ЮС МАЛЫЙ (начертание в виде подчеркнутой "A")
    ("<я_>",       "⍰"),             # ЮС МАЛЫЙ (начертание с соединенными внизу чертой ножками)
    ("<u>",        "⍰"),             # ЮС БОЛЬШОЙ (с двумя ножками вместо трех)
    ("<ын>",       '\uA65F'),        # молдавская (румынская) юсовая буква в виде /|\
    ("=",           '\u0486'),
    ("'",          '\u0301'),
    ("^",          '\u0311'),
    ("`",          '\u0300'),
    ("~",          '\u0483'),
    ("\"",         '\u030F'),
    ("\\ъ",        '\u033E'),
    ("\\Ъ",        '\u033E'),
    ("\\б",        '\u2DE0\u0487'),
    ("\\Б",        '\u2DE0\u0487'),
    ("\\в",        '\u2DE1\u0487'),
    ("\\В",        '\u2DE1\u0487'),
    ("\\г",        '\u2DE2\u0487'),
    ("\\Г",        '\u2DE2\u0487'),
    ("\\д",        '\u2DE3'),
    ("\\Д",        '\u2DE3'),
    ("\\ж",        '\u2DE4'),
    ("\\Ж",        '\u2DE4'),
    ("\\з",        '\u2DE5'),
    ("\\З",        '\u2DE5'),
    ("\\к",        '\u2DE6\u0487'),
    ("\\К",        '\u2DE6\u0487'),
    ("\\л",        '\u2DE7\u0487'),
    ("\\Л",        '\u2DE7\u0487'),
    ("\\м",        '\u2DE8'),
    ("\\М",        '\u2DE8'),
    ("\\н",        '\u2DE9\u0487'),
    ("\\Н",        '\u2DE9\u0487'),
    ("\\о",        '\u2DEA\u0487'),
    ("\\О",        '\u2DEA\u0487'),
    ("\\п",        '\u2DEB'),
    ("\\П",        '\u2DE8'),
    ("\\р",        '\u2DEC\u0487'),
    ("\\Р",        '\u2DEC\u0487'),
    ("\\с",        '\u2DED\u0487'),
    ("\\С",        '\u2DED\u0487'),
    ("\\т",        '\u2DEE'),
    ("\\Т",        '\u2DEE'),
    ("\\х",        '\u2DEF'),
    ("\\Х",        '\u2DEF'),
    ("\\ц",        '\u2DF0'),
    ("\\Ц",        '\u2DF0'),
    ("\\ч",        '\u2DF1\u0487'),
    ("\\Ч",        '\u2DF1\u0487'),
    ("\\ш",        '\u2DF2\u0487'),
    ("\\Ш",        '\u2DF2\u0487'),
    ("\\щ",        '\u2DF3\u0487'),
    ("\\Щ",        '\u2DF3\u0487'),
    ("\\f",        '\u2DF4\u0487'),
    ("\\F",        '\u2DF4\u0487'),
    ("\\а",        '\u2DF6\u0487'),
    ("\\А",        '\u2DF6\u0487'),
    ("\\е",        '\u2DF7'),
    ("\\Е",        '\u2DF7'),
    ("\\g",        '\u2DF8'),
    ("\\G",        '\u2DF8'),
    ("\\у",        '\u2DF9'),
    ("\\У",        '\u2DF9'),
    ("\\jе",       '\u2DFA'),
    ("\\ю",        '\u2DFB'),
    ("\\Ю",        '\u2DFB'),
    ("\\jа",       '\u2DFC'),
    ("\\я",        '\u2DFD'),
    ("\\Я",        '\u2DFD'),
    ("\\u",        '\u2DFE'),
    ("\\U",        '\u2DFE'),
    ("\\ju",       '\u2DFF'),
    ("\\и",        '\uA675'),
    ("\\И",        '\uA675'),
    ("\\^",        '\u0487'),
    ("\\-",        '\u0487'),
    ("#",          '\u0482'),
    ("@",          '\uA67E'),
    ("+",          '\u2020'),
    ("*",          '\uA673'),
    ("<*>",        '\uA673'),
    ("<М\\р>",     '\u1F545'),
    ("<+>",        '\u1F542'),
    ("<\\+/>",     '\u1F541'),
    ("<(+)>",      '\u1F540'),
    ("<(:.>",      '\u1F543'),
    ("<.:)>",      '\u1F544'),
    ("<тьматем>",  '\u0430\uA672'),
    ("<->",        '\u2011'),
]

hip2unicode = multi_replace(PAIRS, longest_first=True)